**Feature Engineering**

- So far we have performed feature analysis

    - Data frame quick checks
 
    - Categorical column analysis
 
    - Numerical columnan alysis
 
    - Bar charts, pie charts
 
    - Numerical columns analysis
 
    - Histograms, box plots, outliers
 
    - correlation stc
 
- Now we need to learn Features Engineering

    - we will create a new columns for better ML models
 
    - we will perform the Encoding, which is convert categorical to Numerical data
 
    - we will do data **transformation**
 
    - we will perform **Scaling: Standardization and Normalization**
 
    - we will perform the **missing value analysis**
 
- Simply feature engineering means our data will be modified

- Feature Analysis

- Feature Engineerig
- Feature Selection
- Model development
- Model evaluation
- Model tuning
- Model deployment

**Encoding**

- Encoding means convert categorical data to Numerical data
- ML/DL or any models works based on maths
- Models can not understand english charcters

- So it is very important convert categorical label to numerical values
- For example Gender column has two lables
   - Male
   - Female
- Then Female represent as 0, Male represent as 1 based on alphabetical order

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
file_path=r"C:\\Users\\P.Siddartha\\Documents\\NareshIT\\datafiles\\Visadataset.csv"
visa_df=pd.read_csv(file_path)

cat=visa_df.select_dtypes(include='object').columns
num=visa_df.select_dtypes(exclude='object').columns

In [2]:
cat

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'region_of_employment', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [3]:
num

Index(['no_of_employees', 'yr_of_estab', 'prevailing_wage'], dtype='object')

In [4]:
visa_df['case_status'].unique()

array(['Denied', 'Certified'], dtype=object)

**mapping**

- Certified == 1
- Denied   === 0

In [5]:
d={'Certified':1,'Denied':0}
d

{'Certified': 1, 'Denied': 0}

In [6]:
visa_df['case_status']=visa_df['case_status'].map(d)

In [7]:
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,0
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,1
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,0
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,0
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,1
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,1
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,1
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,1
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,1
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,1

In [8]:
visa_df['continent'].unique()

array(['Asia', 'Africa', 'North America', 'Europe', 'South America',
       'Oceania'], dtype=object)

In [10]:
# Create a dictionary
d={}
d['Asia']=0
d['Africa']=1
d['North America']=2
d['Europe']=3
d['South America']=4
d['Oceania']=5

d

{'Asia': 0,
 'Africa': 1,
 'North America': 2,
 'Europe': 3,
 'South America': 4,
 'Oceania': 5}

In [11]:
lables=sorted(visa_df['continent'].unique())
n=len(lables)
d={}
for i in range(n):
    d[lables[i]]=i
d

{'Africa': 0,
 'Asia': 1,
 'Europe': 2,
 'North America': 3,
 'Oceania': 4,
 'South America': 5}

In [12]:
lables=sorted(visa_df['continent'].unique())
d={}
for i,j in enumerate(lables):
    d[j]=i
d

{'Africa': 0,
 'Asia': 1,
 'Europe': 2,
 'North America': 3,
 'Oceania': 4,
 'South America': 5}

In [13]:
lables=sorted(visa_df['continent'].unique())
d={j:i for i,j in enumerate(lables)}
visa_df['continent']=visa_df['continent'].map(d)

In [14]:
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,1,High School,N,N,14513,2007,West,592.2029,Hour,Y,0
1,EZYV02,1,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,1
2,EZYV03,1,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,0
3,EZYV04,1,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,0
4,EZYV05,0,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,1
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,1,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,1
25476,EZYV25477,1,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,1
25477,EZYV25478,1,Master's,Y,N,1121,1910,South,146298.8500,Year,N,1
25478,EZYV25479,1,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,1
25479,EZYV25480,1,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,1

In [16]:
lables=sorted(visa_df['continent'].unique())
d={j:i for i,j in enumerate(lables)}
visa_df['continent']=visa_df['continent'].map(d)

# i need to repeat above 3 lines for all cat column
# except case_
for col in visa_df.select_dtypes(include='object').columns:
    if col != 'case_id':
        labels = sorted(visa_df[col].dropna().unique())
        d = {j: i for i, j in enumerate(labels)}
        visa_df[col] = visa_df[col].map(d)

In [17]:
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,1,2,0,0,14513,2007,4,592.2029,0,1,0
1,EZYV02,1,3,1,0,2412,2002,2,83425.6500,3,1,1
2,EZYV03,1,0,0,1,44444,2008,4,122996.8600,3,1,0
3,EZYV04,1,0,0,0,98,1897,4,83434.0300,3,1,0
4,EZYV05,0,3,1,0,1082,2005,3,149907.3900,3,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,1,0,1,1,2601,2008,3,77092.5700,3,1,1
25476,EZYV25477,1,2,1,0,3274,2006,2,279174.7900,3,1,1
25477,EZYV25478,1,3,1,0,1121,1910,3,146298.8500,3,0,1
25478,EZYV25479,1,3,1,1,1918,1887,4,86154.7700,3,1,1
25479,EZYV25480,1,0,1,0,3195,1960,1,70876.9100,3,1,1

**LableEncoder**

- LableEncoder is a method will convert cat lables to numerical values

- It is under package: sklearn (sickit-learn)

- The class Name : preprocessing

- The method name : LabelEncoder

In [19]:
from sklearn.preprocessing import LabelEncoder

- step-1:import the method

- step-2:save the method

- step-3:apply fit transform

- fit transform

   - fit: means find the logic

      - in above example fit means create mapper or dict
  
    - transform: apply the logic and change the data

      - apply the mapper on the data

In [21]:
# read the data again
file_path=r"C:\\Users\\P.Siddartha\\Documents\\NareshIT\\datafiles\\Visadataset.csv"
visa_df=pd.read_csv(file_path)
cat=visa_df.select_dtypes(include='object').columns

# Import the method
from sklearn.preprocessing import LabelEncoder
# save the method
le=LabelEncoder()
# apply fit transform
visa_df['case_status']=le.fit_transform(visa_df['case_status'])
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,1
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,0
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,1
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,1
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,0
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,0
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,0
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,0
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,0

In [22]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
visa_df['continent']=le.fit_transform(visa_df['continent'])
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,1,High School,N,N,14513,2007,West,592.2029,Hour,Y,1
1,EZYV02,1,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,0
2,EZYV03,1,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,1
3,EZYV04,1,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,1
4,EZYV05,0,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,1,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,0
25476,EZYV25477,1,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,0
25477,EZYV25478,1,Master's,Y,N,1121,1910,South,146298.8500,Year,N,0
25478,EZYV25479,1,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,0
25479,EZYV25480,1,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,0

In [23]:
# Read the data 
# get cat columns
# apply for loop on above logic

file_path=r"C:\\Users\\P.Siddartha\\Documents\\NareshIT\\datafiles\\Visadataset.csv"
visa_df=pd.read_csv(file_path)
cat=visa_df.select_dtypes(include='object').columns

from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
for i in cat[1:]:
    visa_df[i]=le.fit_transform(visa_df[i])
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,1,2,0,0,14513,2007,4,592.2029,0,1,1
1,EZYV02,1,3,1,0,2412,2002,2,83425.6500,3,1,0
2,EZYV03,1,0,0,1,44444,2008,4,122996.8600,3,1,1
3,EZYV04,1,0,0,0,98,1897,4,83434.0300,3,1,1
4,EZYV05,0,3,1,0,1082,2005,3,149907.3900,3,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,1,0,1,1,2601,2008,3,77092.5700,3,1,0
25476,EZYV25477,1,2,1,0,3274,2006,2,279174.7900,3,1,0
25477,EZYV25478,1,3,1,0,1121,1910,3,146298.8500,3,0,0
25478,EZYV25479,1,3,1,1,1918,1887,4,86154.7700,3,1,0
25479,EZYV25480,1,0,1,0,3195,1960,1,70876.9100,3,1,0

**OneHotEncoder**

First how many lables are there in a column

That many new columns will be created extra

For example case status has two lables

Certified

Denied

So It will create Two new extra columns

case_status_Certified

case_status_Denied

At a time one column value become 1 other column valu become 0

**pd.get dummies**

In [25]:
file_path=r"C:\\Users\\P.Siddartha\\Documents\\NareshIT\\datafiles\\Visadataset.csv"
visa_df=pd.read_csv(file_path)
cat=visa_df.select_dtypes(include='object').columns

pd.get_dummies(visa_df['case_status'],dtype=int)

       Certified  Denied
0              0       1
1              1       0
2              0       1
3              0       1
4              1       0
...          ...     ...
25475          1       0
25476          1       0
25477          1       0
25478          1       0
25479          1       0

[25480 rows x 2 columns]

In [26]:
visa_df['case_status']

0           Denied
1        Certified
2           Denied
3           Denied
4        Certified
           ...
25475    Certified
25476    Certified
25477    Certified
25478    Certified
25479    Certified
Name: case_status, Length: 25480, dtype: object